# alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to," said the Cat.\n"I don't much care where ——" said Alice.\n"Then it doesn't matter which way you go," said the Cat.\n"—— so long as I get somewhere," Alice added as an explanation.\n"Oh, you're sure to do that," said the Cat, "if you only walk long enough."'
# # task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# # task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# # task 03 == Виведіть змінну alice_in_wonderland на друк

alice_in_wonder = "Розділіть змінну alice_in_wonderland так, \n щоб вона займала декілька фізичних лінії"
print (alice_in_wonder)

print(alice_in_wonder)
alice_in_wonder = """Розділіть змінну alice_in_wonderland так,
" щоб вона займала декілька фізичних ліній"""
print(alice_in_wonder)



# """
#     # Задачі 04 -10:
#     # Переведіть задачі з книги "Математика, 5 клас"
#     # на мову пітон і виведіть відповідь, так, щоб було
#     # зрозуміло дитині, що навчається в п'ятому класі
# """
# # task 04
# """
# Площа Чорного моря становить 436 402 км2, а площа Азовського
# моря становить 37 800 км2. Яку площу займають Чорне та Азов-
# ське моря разом?
# """
s_Chornogo = 436402
s_Azov = 37800
result = s_Chornogo+s_Azov
print ("Площа Чорного і Азовськогоо морів:", result,  "км2")


# # task 05
# """
# Мережа супермаркетів має 3 склади, де всього розміщено
# 375 291 товар. На першому та другому складах перебуває
# 250 449 товарів. На другому та третьому – 222 950 товарів.
# Знайдіть кількість товарів, що розміщені на кожному складі.
# """

s_total = 375291
s_first_second = 250449
s_second_third = 222950
x = s_total - s_first_second
y = s_second_third - x
z = s_total - x - y
print("Кількість товарів на першому складі",  z)
print("Кількість товарів на другому складі",  y)
print("Кількість товарів на третьому складі",  x)


# # task 06
# """
# Михайло разом з батьками вирішили купити комп’ютер, ско-
# риставшись послугою «Оплата частинами». Відомо, що сплачу-
# вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
# вартість комп’ютера.
# """
cost = 1179 * 18
print ("Вартість  комп'ютера:", cost)

# # task 07
# """
# Знайди остачу від діленя чисел:
# a) 8019 : 8     d) 7248 : 6
# b) 9907 : 9     e) 7128 : 5
# c) 2789 : 5     f) 19224 : 9
# """

a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
print ("a =", a)
print ("b =", b)
print ("с =", c)
print ("d =", d)
print ("e =", e)
print ("f =", f)
# # task 08
# """
# Іринка, готуючись до свого дня народження, склала список того,
# що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
# для даного її замовлення.
# Назва товару    Кількість   Ціна
# Піца велика     4           274 грн
# Піца середня    2           218 грн
# Сік             4           35 грн
# Торт            1           350 грн
# Вода            3           21 грн
# """

pizza_big = 4 * 274
pizza_small = 2 * 218
juice = 4 * 35
cake = 1 * 350
water = 3 * 21
total = pizza_big + pizza_small + juice + cake + water
print ("Замовлення", total, "грн")

# # task 09
# """
# Ігор займається фотографією. Він вирішив зібрати всі свої 232
# фотографії та вклеїти в альбом. На одній сторінці може бути
# розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
# Ігорю, щоб вклеїти всі фото?
# """
total_photos = 232
photos_per_page = 8
page = total_photos//photos_per_page
page_1 = total_photos %  photos_per_page
if page_1 > 0 :
    print  (page + 1)

print ("Знадобиться", page, "сторінок")

# # task 10
# """
# Родина зібралася в автомобільну подорож із Харкова в Буда-
# пешт. Відстань між цими містами становить 1600 км. Відомо,
# що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
# становить 48 літрів.
# 1) Скільки літрів бензину знадобиться для такої подорожі?
# 2) Скільки щонайменше разів родині необхідно заїхати на зап-
# равку під час цієї подорожі, кожного разу заправляючи пов-
# ний бак?
# """

distance = 1600
petrol_100km = 9
tank = 48
petrol_travel = 1600 // 100 *9
refuel_times = petrol_travel // tank
print ("Для подорожі знадобиться", petrol_travel, "л бензину")
print ("Мінімум необхідно заправитися", refuel_times, "рази")

