# Створіть клас геометричної фігури "Ромб". Клас повинен мати наступні атрибути:

# сторона_а (довжина сторони a).
# кут_а (кут між сторонами a і b).
# кут_б (суміжний з кутом кут_а).
# Необхідно реалізувати наступні вимоги:

# Значення сторони сторона_а повинно бути більше 0.
# Кути кут_а та кут_б повинні задовольняти умову: кут_а + кут_б = 180
# Протилежні кути ромба завжди рівні, тому при заданому значенні кут_а, 
# значення кут_б обчислюється автоматично.


class Diamond:
    def __init__(self, side, alpha):
        if side > 0:
            self.side = side
        else:
            print ("Сторона повинна бути більше 0")
        if 0 < alpha < 180:
            self.alpha = alpha
            self.beta = 180 - alpha
        else:
            print ("Кут  повинен  бути  між (0,180)")

d = Diamond(7, 60)
print(d.side)   # 5
print(d.alpha)  # 60
print(d.beta)   # 120
